# списки и кортежи

a = [2 , 5.1 , "Ayan" , True] #контейнеры (список)
b = (2 , 5.1 , "Ayan" , True) #тоже контейнер (кортеж)

#Работа с контейнерами

spisok = ["a" , "b" , "c" , "d" , "e"]
print(spisok[0]) # Индексация

print(len(spisok)) # кол-во элементор в контейнере


s = "абракадабра"
print(len(s)) # кол-во букв в элементе

#Срезы[Старт:Стоп:Шаг]

lst = ["a" , "b" , "c" , "d" , "e"]

print(lst[2:]) #Старт с 2 го элемента
print(lst[:2]) #Заканчивать до 2 го элемента
print(lst[1:3])
print(lst[::2]) # через 2

del lst[:2] #удалить
print(lst)

#length
a = "Hello, World!"
print(len(a))
